[{"content": "I have been a deliveroo plus customer until recently as I decided to cancel my membership. I was quite annoyed to find out that in some cases, deliveroo is charging a higher price on the dishes on top of the restaurant prices. This is despite being a plus member and paying an admin fee on every order. The actual straw that broke the camel’s back for me was a large order I made through them. I placed a large order for a group of friends for a special Friday occasion. It was placed well with plenty of time ahead of expected delivery. The order showed as processed, then out for delivery then as the driver was literally one minute away I got a notification saying the order was cancelled. The customer support told me they cancelled that large order because one side dish was not available.This is super problematic on many counts. - the fact that they cancel a large order just because a side dish is not available . They could have refunded the side dish and send the ones that are available - the fact that they can cancel an order made 1hour in advance literally last minute- the fact that the status update on the app is so unreliable. How can it show the order complete and almost arrived but cancelled when driver was 1 minute awayThis has ruined my Friday and I don’t forgive them. Only thing they offered was a ridiculous £5 credit which I refusedStay away from this overpriced joke that is deliveroo", "created_at": "2022-03-21T14:37:49.000Z", "rating": "Rated 1 out of 5 stars", "title": "Overpriced and poor customer service…"}, {"content": "Only the 2nd time of using deliveroo and probably never again! Placed a basic order at KFC and it didn't get delivered until 2 hours later...except it wasn't even the correct order given to us! We had to eat someone else's order (which was less food) and stone cold anyway!", "created_at": "2022-03-21T14:27:05.000Z", "rating": "Rated 1 out of 5 stars", "title": "Just poor all round..."}, {"content": "We ordered a takeaway in December only to see a £7.99 charge on our February bank statement.  Our bank told us that we had set up a regular payment for Deliveroo's plus service.  This must be one of those almost hidden click buttons, we had no need for this as we rarely have take out food.  We contacted Deliveroo who emailed us to say there was no account under our email address.  They have now taken a second £7.99 this month.  Our bank has put a stop on any further transactions but we consider that Deliveroo have acted in a very underhand manner as they claim we do not have an account with them but they are happy to deduct £7.99 from us each month!", "created_at": "2022-03-21T13:30:58.000Z", "rating": "Rated 1 out of 5 stars", "title": "An unresolved regular monthly payment we were not aware of"}, {"content": "The first time I used Deliveroo and items missing food cold and rude delivery personApp deleted should be avoided at all cost.", "created_at": "2022-03-21T12:37:18.000Z", "rating": "Rated 1 out of 5 stars", "title": "No stars should be an option"}, {"content": "Everytime I’ve had groceries delivered there is always over half missing, they don’t give the right refund and so must be making a fortune.It’s scandalous how they can do this, the driver didn’t social distance and got annoyed that I couldn’t understand a word when he was asking for a code that I had no idea I had to show..I felt I was ripped off and then treated with very poor customer service alongside weary of eating what actually did come", "created_at": "2022-03-21T08:03:41.000Z", "rating": "Rated 1 out of 5 stars", "title": "Everytime I’ve had groceries delivered…"}, {"content": "Ordered food that was never delivered. No explanations given. The order number 5698. Their service and attitude is just rubbish. Don't waste your time with them.", "created_at": "2022-03-21T00:06:40.000Z", "rating": "Rated 1 out of 5 stars", "title": "Ordered food that was never delivered"}, {"content": "Do not order from Fumo, Manchester Oily, overcooked, drenched in tomato sauce, tasteless and over priced!", "created_at": "2022-03-20T22:42:59.000Z", "rating": "Rated 1 out of 5 stars", "title": "Do not order from Fumo"}, {"content": "My deliveries have always been on point and on time.", "created_at": "2022-03-20T21:18:36.000Z", "rating": "Rated 5 out of 5 stars", "title": "My deliveries have always been on point…"}, {"content": "Disgusting service! Ordered Nandos for them to ‘confirm delivery’ and not deliver our food. Was advised to order again and they done the same thing! Heavily pregnant and I’ve had to wait over 2 hours for food that I still haven’t received because of their incompetent drivers. Refund takes 5-10 working days as well not good enough! Won’t be using Deliveroo ever again.", "created_at": "2022-03-20T20:58:21.000Z", "rating": "Rated 1 out of 5 stars", "title": "Disgusting service"}, {"content": "DO NOT ORDER FROM THEMExtremelly overpriced delivery fee, they do not refund if your order is late or wrong, they will just apologise but not give you any help.The food usually arrives practically cold and always late.", "created_at": "2022-03-20T20:23:28.000Z", "rating": "Rated 1 out of 5 stars", "title": "DO NOT ORDER FROM THEM"}, {"content": "Very slowly progress when you make the new application take too long to process.", "created_at": "2022-03-20T19:45:04.000Z", "rating": "Rated 3 out of 5 stars", "title": "Very slowly progress when you make the…"}, {"content": "CS are crazy Indian machines replying to email with random useless templates", "created_at": "2022-03-20T19:16:14.000Z", "rating": "Rated 1 out of 5 stars", "title": "No Customer Service at all"}, {"content": "Placed an order and the rider phoned to say he was outside, went outside - no driver and no order. Tried to phone him many times and no response. Eventually had to send an email and contacted customer service only to find out that the order had been delivered to another address!!", "created_at": "2022-03-20T14:30:07.000Z", "rating": "Rated 1 out of 5 stars", "title": "Terrible Service (actually no service!)"}, {"content": "Absolutely terrible customer service. Had wrong order delivered took a photo of wrong delivery as requested and was tokd thats ok and will process the refund. Been fobbed off all week on live chat to then be told i will not recieve refund and no reason.", "created_at": "2022-03-20T07:57:42.000Z", "rating": "Rated 1 out of 5 stars", "title": "Absolutely terrible customer service"}, {"content": "Do not use them, my food was tampered  with the packet was open and wet. The driver was annoyed as had to climb stairs. Do not use them", "created_at": "2022-03-20T06:38:46.000Z", "rating": "Rated 1 out of 5 stars", "title": "Do not use them"}, {"content": "They replaced our Wagamama order with cheaper items, and it was really late. Deliveroo blamed the restaurant and vice versa. Don't bother!", "created_at": "2022-03-19T22:58:39.000Z", "rating": "Rated 1 out of 5 stars", "title": "Wagamama takeaway"}, {"content": "£30 order today from a restaurant a couple of miles away. Turned up two hours later, stone cold, and threw it away.  Deliveroo refunded £2.83.  Since then no response from them.  Never using those jokers again.  AVOID", "created_at": "2022-03-20T18:14:31.000Z", "rating": "Rated 1 out of 5 stars", "title": "Hopeless"}, {"content": "ABSOLUTELY AWFUL!! Paid £50 in total for a wagamama dinner, took over two hours to be picked up and arrive and obviously the food was cold! I Rang the restaurant and they were great, short staffed doing their best & offering good will vouchers for the restaurant & explaining how bad deliveroo were being this evening. When contacting deliveroo and sorting out the “compensation” we got no where near half back! On the chat some melty guy explaining how they can’t help any other way…basically stealing the rest of our money for their poor service of goods bought! NEVER use these useless thieves!", "created_at": "2022-03-19T22:30:54.000Z", "rating": "Rated 1 out of 5 stars", "title": "ABSOLUTELY AWFUL!"}, {"content": "Totally wrong Order delivered, cold food, 1 x whole meal missing, wrong drinks, missing other items, live chat consists of copy & paste chats with no other remedy than a promise of a refund which ain’t no good to no one when you’ve waited for your food for an hour. First and last time ordering that’s for sure", "created_at": "2022-03-19T22:08:13.000Z", "rating": "Rated 1 out of 5 stars", "title": "Totally wrong Order delivered"}, {"content": "Incredu=ibly bad customer service. I've ordered a takeaway that had a promotion. I paid using some credits I had and for some reason, the discount didn't apply. I've asked the CS the reason and they came back t me a month later saying basically \"we are so sorry that that happened to you\". And that's it, no explanation. I've asked again a couple f times with the same result.", "created_at": "2022-03-19T21:50:17.000Z", "rating": "Rated 1 out of 5 stars", "title": "Incredibly bad customer service"}]